src/toir_cf/src/Reports/торо_НаработкаОборудования/торо_НаработкаОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_НаработкаОборудования</name>
</mdclass:Report>

src/toir_cf/src/AccumulationRegisters/торо_НаработкаОбъектовРемонта/торо_НаработкаОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_НаработкаОбъектовРемонта</name>
  <resources>
    <name>Наработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cf/src/InformationRegisters/торо_МаксимальныеЗначенияНаработкиОР/торо_МаксимальныеЗначенияНаработкиОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МаксимальныеЗначенияНаработкиОР</name>
  <resources>
    <name>МаксимальноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НазначенныйРесурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Reports/торо_НаработкаОборудования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ТекИерархия = торо_ОтчетыСервер.ПолучитьЗначениеСтруктурыИерархии(КомпоновщикНастроек);
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ДатаОкончания");
	
	Если ТекИерархия.СтроитсяАвтоматически Тогда
				
		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_НаработкаОбъектовРемонта.Регистратор.Организация КАК Организация,
		|	торо_НаработкаОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_НаработкаОбъектовРемонта.Показатель КАК ПоказательНаработки,
		|	ВЫБОР
		|		КОГДА торо_НаработкаОбъектовРемонта.ДатаНач = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА торо_НаработкаОбъектовРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию
		|		ИНАЧЕ торо_НаработкаОбъектовРемонта.ДатаНач
		|	КОНЕЦ КАК НачалоПериода,
		|	торо_НаработкаОбъектовРемонта.ДатаКон КАК ОкончаниеПериода,
		|	торо_НаработкаОбъектовРемонта.Наработка КАК Наработка,
		|	торо_НаработкаОбъектовРемонта.Период КАК Период,
		|	торо_ОбъектыРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии,
		|	торо_МаксимальныеЗначенияНаработкиОР.НазначенныйРесурс КАК НазначенныйРесурс
		|ИЗ
		|	РегистрНакопления.торо_НаработкаОбъектовРемонта КАК торо_НаработкаОбъектовРемонта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО торо_НаработкаОбъектовРемонта.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР КАК торо_МаксимальныеЗначенияНаработкиОР
		|		ПО торо_НаработкаОбъектовРемонта.ОбъектРемонта = торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта
		|			И торо_НаработкаОбъектовРемонта.Показатель = торо_МаксимальныеЗначенияНаработкиОР.Показатель
		|ГДЕ
		|	торо_НаработкаОбъектовРемонта.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И НЕ торо_НаработкаОбъектовРемонта.Регистратор.Организация ЕСТЬ NULL
		|{ГДЕ
		|	(торо_НаработкаОбъектовРемонта.Период МЕЖДУ &ДатаНачала И &ДатаОкончания)}";

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
		
	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_НаработкаОбъектовРемонта.Регистратор.Организация КАК Организация,
		|	торо_НаработкаОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_НаработкаОбъектовРемонта.Показатель КАК ПоказательНаработки,
		|	ВЫБОР
		|		КОГДА торо_НаработкаОбъектовРемонта.ДатаНач = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА торо_НаработкаОбъектовРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию
		|		ИНАЧЕ торо_НаработкаОбъектовРемонта.ДатаНач
		|	КОНЕЦ КАК НачалоПериода,
		|	торо_НаработкаОбъектовРемонта.ДатаКон КАК ОкончаниеПериода,
		|	торо_НаработкаОбъектовРемонта.Наработка КАК Наработка,
		|	торо_НаработкаОбъектовРемонта.Период КАК Период,
		|	торо_ОбъектыРемонта.Ссылка КАК ОбъектИерархии,
		|	торо_МаксимальныеЗначенияНаработкиОР.НазначенныйРесурс КАК НазначенныйРесурс
		|ИЗ
		|	РегистрНакопления.торо_НаработкаОбъектовРемонта КАК торо_НаработкаОбъектовРемонта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО торо_НаработкаОбъектовРемонта.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР КАК торо_МаксимальныеЗначенияНаработкиОР
		|		ПО торо_НаработкаОбъектовРемонта.ОбъектРемонта = торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта
		|			И торо_НаработкаОбъектовРемонта.Показатель = торо_МаксимальныеЗначенияНаработкиОР.Показатель
		|ГДЕ
		|	торо_НаработкаОбъектовРемонта.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И НЕ торо_НаработкаОбъектовРемонта.Регистратор.Организация ЕСТЬ NULL
		|{ГДЕ
		|	(торо_НаработкаОбъектовРемонта.Период МЕЖДУ &ДатаНачала И &ДатаОкончания)}";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = ЗагрузитьНастройкиПриИзмененииПараметров();

КонецПроцедуры

Функция ЗагрузитьНастройкиПриИзмененииПараметров()  
	
	Параметры = Новый Массив;
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("ИерархияТип"));	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#КонецЕсли
